#ΑΣΚΗΣΗ 9 ΥΛΟΠΟΙΗΜΕΝΗ ΜΕ ΣΥΝΑΡΤΗΣΕΙΣ


#Εισαγωγή βιβλιοθήκης
import math

#Δήλωση του λεξικού στο οποίο θα αποθηκευτούν τα κλειδιά που θα δώσει ο χρήστης
numbers_given =dict()


#Δήλωση της συνάρτησης "γεμίσματος" του λεξικού
def dic_filling(d1 = dict()):
    
    number = 1


    while number >=0 :   #TRUE αν number >= 0 
     
        #Εντολές στις οποίες πιθανόν να προκύψουν σφάλματα, συντακτικά ή λογικά 
        try:
        
            # Διάβασμα του αριθμού προς εισαγωγή στο λεξικό ως κλειδί, από το χρήστη
            number = int(input("Δώσε ένα θετικό, ακέραιο αριθμό για να εισαχθεί στο λεξικό (με την εισαγωγή αρνητικού αριθμού γίνεται τερματισμός του προγράμματος): "))
    
    
    
        #Έλεγχος για συντακτικά λάθη 
        except ValueError:
    
            print(f"Δεν έδωσες κάποιον αριθμό. Παρακαλώ ξαναπροσπάθησε!")
    

   
   
        else:

            if number < 0:
                break
        
            #Εισαγωγή του αριθμού που εισήχθη από το χρήστη ως κλειδί, και της ρίζας του αριθμού αυτού ως τιμή στο λεξικό
            numbers_given[number]= math.sqrt(number)
            


dic_filling(numbers_given) 


#Εμφάνιση των κλειδιών και των τιμών τους που έχουν εισαχθεί στο λεξικό
for key,value in numbers_given.items():
    print(f'Κλειδί:{key}, Τιμή:{value}')

print("Τέλος προγράμματος")



