
#ΑΣΚΗΣΗ 3.4


#διάβασμα του ονόματος (name) του χρήστη
name = input("Δωσε το όνομα σου: ")

#Διάβασμα της ηλικίας (age) του χρήστη 
age = float(input("Δώσε την ηλικία σου: "))

if age <=0 or age >115:   #TRUE αν age <=0 and age > 15
    print(f"{name}, μη επιτρεπτή είσοδος. Παρακαλώ ξαναδώσε την ηλικία σου!")
    age = float(input("Δώσε την ηλικία σου: "))
    
if  age <17:              #TRUE αν age >0 and age <17
    print(f"{name}, δεν έχεις δικαίωμα να ψηφίσεις στις επόμενες εκλογές, αφού δεν έχεις συμπληρώσει το 17ο έτος της ηλικία σου!")
    

elif age >= 17 and age <=75:        #TRUE αν age >=17 and age <=75
    print(f"{name}, πρέπει υποχρεωτικά να ψηφίσεις στις επόμενες εκλογές!")
    

else:                      #TRUE αν age >75 and age <=115    
    print(f"{name}, έχεις το δικαίωμα να ψηφίσεις στις επόμενες εκλογές αλλά δεν είναι και υποχρεωτικό!")









