
#ΑΣΚΗΣΗ 2 ΜΕ ΕΛΕΓΧΟΥΣ ΕΚΣΦΑΛΜΑΤΩΣΗΣ


#Εντολές στις οποίες πιθανόν να προκύψουν σφάλματα, συντακτικά ή λογικά 
try:
    # Διάβασμα της κατανάλωσης (consumption) ανά 100 χλμ. από το χρήστη (θετικός, float αριθμός)
    consumption = float(input("Δώσε την κατανάλωση του οχήματος ανά 100 χλμ σε λίτρα (θετικός αριθμός): "))
    
    #πρέπει η κατανάλωση να είναι θετικός αριθμός
    assert consumption >0

    # Διάβασμα της απόστασης (distance), που θα διανύσει το όχημα, από το χρήστη
    distance = float(input("Δώσε την απόσταση που θα καλύψει το όχημα σε χλμ (θετικός αριθμός): "))
    
    #πρέπει η απόσταση να είναι θετικός αριθμός
    assert distance >0

    
#Έλεγχος για συντακτικά λάθη
except ValueError:
    print("Δεν έδωσες κάποιον αριθμό. Παρακαλώ ξαναπροσπάθησε!")


#Έλεγχος για λογικά λάθη
except AssertionError :
  print("Ο αριθμός που έδωσες δεν είναι θετικός. Παρακαλώ ξαναπροσπάθησε!")


#Εκτέλεση των παρακάτω εντολών αν δεν προκύψει κανένα σφάλμα παραπάνω
else:
    # Η ποσότητα καυσίμων (fuel) που απαιτείται για ένα δρομολόγιο δίνεται από την παρακάτω σχέση :
    fuel = round((consumption / 100) * distance, 2)

    # Εμφάνιση τελικού μηνύματος και αποτελέσματος
    print(f"Για κατανάλωση ίση με {consumption} λίτρα ανά 100 χλμ, και για απόσταση ίση με {distance} χλμ, απαιτείται ποσότητα καυσίμων ίση με {fuel} λίτρα")
