
#ΑΣΚΗΣΗ 3 (3.4) ΜΕ ΕΛΕΓΧΟΥΣ ΕΚΣΦΑΛΜΑΤΩΣΗΣ



#διάβασμα του ονόματος (name) του χρήστη
name = input("Δωσε το όνομα σου: ")
 
#Εντολές στις οποίες πιθανόν να προκύψουν σφάλματα, συντακτικά ή λογικά 
try:
    
    #Διάβασμα της ηλικίας (age) του χρήστη 
    age = float(input("Δώσε την ηλικία σου: "))
    
    assert 0<age<115    #θεωρούμε ότι αν ο χρήστης δώσει ως ηλικία αρνητικό αριρθμό, 0 ή έναν αριθμό πάνω από το 114, πρόκειται για λάθος
        
    
#Έλεγχος για συντακτικά λάθη 
except ValueError:
    print(f"{name}, δεν έδωσες κάποιον αριθμό. Παρακαλώ ξαναπροσπάθησε!")
 


#Έλεγχος για λογικά λάθη   
except AssertionError :
  print(f"{name}, μη επιτρεπτή είσοδος. Παρακαλώ ξαναπροσπάθησε!")


#Εκτέλεση των παρακάτω εντολών αν δεν προκύψει κανένα σφάλμα παραπάνω
else:
    if  age <17:                        #TRUE αν age >0 and age <17
        print(f"{name}, δεν έχεις δικαίωμα να ψηφίσεις στις επόμενες εκλογές, αφού δεν έχεις συμπληρώσει το 17ο έτος της ηλικία σου, αφού είσαι {age} ετών!")
    

    elif age >= 17 and age <=75:        #TRUE αν age >=17 and age <=75
        print(f"{name}, πρέπει υποχρεωτικά να ψηφίσεις στις επόμενες εκλογές, αφού είσαι {age} ετών!")
    

    else:                               #TRUE αν age >75 and age <=115    
        print(f"{name}, έχεις το δικαίωμα να ψηφίσεις στις επόμενες εκλογές αλλά δεν είναι και υποχρεωτικό, αφού είσαι {age} ετών!")


    


