#ΑΣΚΗΣΗ 3.4. ΓΙΑ ΠΡΟΚΑΘΟΡΙΣΜΕΝΟ ΑΡΙΘΜΟ ΨΗΦΟΦΟΡΩΝ ΠΟΥ ΔΙΝΕΤΑΙ ΑΠΟ ΤΟ ΧΡΗΣΤΗ


#Εντολές στις οποίες πιθανόν να προκύψουν σφάλματα, συντακτικά ή λογικά 
try:
    
    #Διάβασμα του αριθμού των ψηφοφόρων (number_of_voters) από το χρήστη
    number_of_voters = int(input("Δώσε το πλήθος των ψηφοφόρων: "))
    
    assert number_of_voters > 0   #προφανώς πρέπει ο αριθμός των ψηφοφόρων που θα δωθεί από το χρήστη, να είναι θετικός αριθμός
    
    for i in range (number_of_voters):
        
        #διάβασμα του ονόματος (name) του χρήστη
        name = input(f"Δωσε το όνομα του {i +1}ου ψηφοφόρου : ")
       
        #Διάβασμα της ηλικίας (age) του χρήστη 
        age = float(input(f"Δώσε την ηλικία του {i+1}ου ψηφοφόρου: "))
    
        
        assert 0<age<115    #θεωρούμε ότι αν ο χρήστης δώσει ως ηλικία αρνητικό αριρθμό, 0 ή έναν αριθμό πάνω από το 114, πρόκειται για λάθος
    
        
        if  age <17:                        #TRUE αν age >0 and age <17
            print(f"{name}, δεν έχεις δικαίωμα να ψηφίσεις στις επόμενες εκλογές, αφού δεν έχεις συμπληρώσει το 17ο έτος της ηλικία σου, αφού είσαι {age} ετών!")
    

        elif age >= 17 and age <=75:        #TRUE αν age >=17 and age <=75
            print(f"{name}, πρέπει υποχρεωτικά να ψηφίσεις στις επόμενες εκλογές, αφού είσαι {age} ετών!")
    

        else:                               #TRUE αν age >75 and age <=114 
            print(f"{name}, έχεις το δικαίωμα να ψηφίσεις στις επόμενες εκλογές αλλά δεν είναι και υποχρεωτικό, αφού είσαι {age} ετών!")

 
        
    
#Έλεγχος για συντακτικά λάθη 
except ValueError:
    print(f"Δεν έδωσες κάποιον αριθμό. Παρακαλώ ξαναπροσπάθησε!")
 


#Έλεγχος για λογικά λάθη   
except AssertionError :
  print(f"Μη επιτρεπτή είσοδος. Παρακαλώ ξαναπροσπάθησε!")

