# ΑΣΚΗΣΗ 3.4 ΓΙΑ ΑΠΡΟΣΔΙΟΡΙΣΤΟ ΑΡΙΘΜΟ ΨΗΦΟΦΟΡΩΝ ΜΕ ΧΡΗΣΗ ΤΗΣ ΔΟΜΗΣ ΕΠΑΝΑΛΉΨΗΣ WHILE


number_of_under_17 = 0  # μεταβλητή στην οποία θα καταχωρείται ο συνολικός αριθμός των ψηφοφόρων που δεν επιτρέπεται να ψηφήσουν
i = 1                   #μεταβλητή στην οποία θα καταχωρείται ο συνολικός αριθμός των ψηφοφόρων που έχουν προσπαθήσει να δουν αν μπορούν να ψηφίσουν

while(number_of_under_17 < 3) :  #TRUE αν number_of_under_17 < 3 (δηλαδή =1 ή =2)
     
     
     #διάβασμα του ονόματος (name) του χρήστη
     name = input(f"Δωσε το όνομα του {i}ου ψηφοφόρου : ")
     
     
     #Εντολές στις οποίες πιθανόν να προκύψουν σφάλματα, συντακτικά ή λογικά 
     try : 
         
         #Διάβασμα της ηλικίας (age) του χρήστη 
        age = float(input(f"Δώσε την ηλικία του {i}ου ψηφοφόρου: "))
    
        
        assert 0<age<115    #θεωρούμε ότι αν ο χρήστης δώσει ως ηλικία αρνητικό αριρθμό, 0 ή έναν αριθμό πάνω από το 114, πρόκειται για λάθος
        
        
     #Έλεγχος για συντακτικά λάθη 
     except ValueError:
         print(f"{name}, δεν έδωσες κάποιον αριθμό. Παρακαλώ ξαναπροσπάθησε!")
 


     #Έλεγχος για λογικά λάθη   
     except AssertionError :
        print(f"{name}, μη επιτρεπτή είσοδος. Παρακαλώ ξαναπροσπάθησε!")
        
    
    
     else :
         
         if  age <17:                        #TRUE αν age >0 and age <17
            print(f"{name}, δεν έχεις δικαίωμα να ψηφίσεις στις επόμενες εκλογές, αφού δεν έχεις συμπληρώσει το 17ο έτος της ηλικία σου, αφού είσαι {age} ετών!")
            
            #Στην περ΄ίπτωση αυτή αυξάνεται κατά 1 η μεταβλητή που καταχωρεί το συνολικό αριθμό των ψηφοφόρων που δεν επιτρέπεται να ψηφήσουν
            number_of_under_17 = number_of_under_17 +1  

         elif age >= 17 and age <=75:        #TRUE αν age >=17 and age <=75
            print(f"{name}, πρέπει υποχρεωτικά να ψηφίσεις στις επόμενες εκλογές, αφού είσαι {age} ετών!")
    

         else:                               #TRUE αν age >75 and age <=114 
            print(f"{name}, έχεις το δικαίωμα να ψηφίσεις στις επόμενες εκλογές αλλά δεν είναι και υποχρεωτικό, αφού είσαι {age} ετών!")
        
         i = i + 1   # αύξηση κατά 1 της μεταβλητής στην οποία θα καταχωρείται ο συνολικός αριθμός των ψηφοφόρων που έχουν προσπαθήσει να δουν αν μπορούν να ψηφίσουν


print("Ο μέγιστος αριθμός ατόμων που δεν επιτρέπεται να ψηφίσουν στις φετινές εκλογές έχει συμπληρωθεί. Τέλος προγράμματος.")
    
    
    
    
    
    
    




