# ΑΣΚΗΣΗ 6.1. (Πέτρα-Ψαλίδι-Χαρτί) ΜΕ ΕΛΕΓΧΟΥΣ ΕΚΣΦΑΛΜΑΤΩΣΗΣ ΚΑΙ ΜΕ ΧΡΗΣΗ ΛΙΣΤΩΝ


#Εισαγωγή βιβλιοθήκης random
import random 

#δημιουργία μιας κενής λίστας 
valid_options = list()

#προσθήκη όλων των επιτρεπτών επιλογών που μπορεί να επιλέξει στη συνέχεια ο χρήστης
valid_options = [1,2,3]

#Μετρητής νικών
winning_count = 0


#μεταβλητή που αποθηκεύεται ο αριθμός των πόντων που πρέπει να συγκεντρώσει ο χρήστης για να νικήσει το παιχνίδι
winning_score = 3


print("Καλωσήρθατε στο παιχνίδι πέτρα - ψαλίδι - χαρτί. Για να νικήσετε πρέπει να συγκεντρώσετε 3 πόντους νίκης. Καλή διασκέδαση!")


while winning_count < winning_score :    #TRUE έως η τιμή του count να γίνει ίση με 3

  #Δομή επανάληψης μέχρι να γίνει εγκυρη εισαγωγή αριθμού στην μεταβλητή RockScissorsPaper
  while True: 

     #Εντολές στις οποίες πιθανόν να προκύψουν σφάλματα, συντακτικά ή λογικά 
     try:  
          RockScissorsPaper = int(input('Για πέτρα δώσε 1 , για ψαλίδι δώσε 2 , για χαρτί δώσε 3 :'))
     
    #Έλεγχος για συντακτικά λάθη 
     except ValueError: #Ελέγχει εαν έχει δωθεί ακέραιος
          
         print('Δεν έδωσες κάποιον αριθμό! Παρακαλώ ξαναπροσπάθησε!')
         continue
          
     else:
          if RockScissorsPaper in valid_options :    #TRUE αν ο χρήστης έχει δώσει ως επιλογή 1 ή 2 ή 3 
              break     #Εαν η είσοδος είναι 1 η 2 η 3 βγαίνει από το while True

     print("Μη επιτρεπτή είσοδος. Παρακαλώ ξαναπροσπάθησε!")
     #print('Επέλεξε 1 για πέτρα, 2 για ψαλίδι, 3 για χαρτί')


  #Παράγεται ένας τυχαίος αριθμός από το 1 μέχρι το 3
  pc_choice =random.randint(1,3) 


  # Εξετάζει όλες τις πιθανές περιπτώσεις στις οποίες νικάει ο χρήστης δηλαδή Χρ΄ήστης -> πέτρα και σύστημα -> ψαλίδι, χρήστης -> ψαλίδι και σύστημα -> χαρτί, χρήστης -> χαρτί και σύστημα -> πέτρα
  if (RockScissorsPaper ==1 and pc_choice ==2) or (RockScissorsPaper ==2 and pc_choice ==3) or (RockScissorsPaper==3 and pc_choice ==1):

    #Δίνει ένα πόντο νίκης στο χρήστη
    winning_count= winning_count+1 

    print(f'Επιλέξατε {RockScissorsPaper} και έτυχε {pc_choice} , μόλις πήρατε τον {winning_count}o πόντο νίκης σας!')


  else: #Μπαίνει σε περίπτωση που ο χρήσης δεν δεν πάρει πόντο νίκης, δηλαδή στις ακριβώς αντίθετες περιπτώσεις από αυτές που περιγράφηκαν παραπάνω
    
    print(f'Επιλέξατε {RockScissorsPaper} και το σύστημα έτυχε {pc_choice} και συνεπώς δεν παίρνετε πόντο νίκης!')


print('Συγχαρητήρια έχετε συγκεντρώσει 3 πόντους. Είστε ο νικητής!')  
